Revit 2027 API
SchemaBuilder.SetSchemaName Method
 Sets the name of the Schema.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SchemaBuilder SetSchemaName(
	string schemaName
)
Public Function SetSchemaName (
	schemaName As String
) As SchemaBuilder
public:
SchemaBuilder^ SetSchemaName(
	String^ schemaName
)
member SetSchemaName :
        schemaName : string -> SchemaBuilder
Parameters
schemaName String
 The name for the Schema.
Return Value
SchemaBuilder
 The SchemaBuilder object may be used to add more settings.
Exceptions
Exception | Condition
ArgumentException |  The parameter schemaName is not acceptable for naming Extensible Storage objects.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The SchemaBuilder has already finished building the Schema.
Remarks
 The name is a user-friendly identifier of the Schema. GUIDs are used exclusively for Schema identity, but the name is useful to identify the Schema during development or in an error message. This field is required.
See Also
Reference
SchemaBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace